2S/Discrete/Project2.tex
% Created 2024-04-01 Mon 14:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{placeins}
\usepackage{gensymb}
\usepackage{minted}
\author{Christian Johnson /and Aidan Andersen}
\date{\today}
\title{Project 2}
\hypersetup{
 pdfauthor={Christian Johnson /and Aidan Andersen},
 pdftitle={Project 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage



\section{Python Code}
\label{sec:orga2c43bb}
\begin{minted}[,frame=single]{python}
from math import factorial

def Pascal(numRows):
    triangle=""
    for i in range(numRows+1):
        for j in range(numRows-i+1):
            triangle+="  "
        # loop to get elements of row i
        for j in range(i+1):
            # nCr = n!/((n-r)!*r!)
            num=factorial(i)
            den=factorial(j)*factorial(i-j)
            triangle+=( str(num//den) + "   " )

        triangle+="\n"

    return triangle
\end{minted}

\section{Print Pascal's Triangle}
\label{sec:org8da48fe}

\subsection{\((s-t)^{10}\)}
\label{sec:orge7c80de}

\begin{minted}[,frame=single]{python}
Pascal(10)
\end{minted}

\begin{verbatim}
                    1   
                  1   1   
                1   2   1   
              1   3   3   1   
            1   4   6   4   1   
          1   5   10   10   5   1   
        1   6   15   20   15   6   1   
      1   7   21   35   35   21   7   1   
    1   8   28   56   70   56   28   8   1   
  1   9   36   84   126   126   84   36   9   1   
1   10   45   120   210   252   210   120   45   10   1   
\end{verbatim}

\textbf{Binomial Expansion}:
\(s^{10}+10s^{9}t+45s^{8}t^2+120s^7t^3+210s^6t^4+252s^5t^5+210s^4t^6+120s^3t^7+45s^2t^8+10st^9+t^{10}\)

\subsection{\((2x+y)^5\)}
\label{sec:orga8ec93b}
\begin{minted}[,frame=single]{python}
Pascal(5)
\end{minted}

\begin{verbatim}
          1   
        1   1   
      1   2   1   
    1   3   3   1   
  1   4   6   4   1   
1   5   10   10   5   1   
\end{verbatim}


\textbf{Binomial Expansion}:
\(2x^{5}+5(2x)^{4}y+10(2x)^{3}y^{2}+10(2x)^{2}y^{3}+5(2x)y^{4}+y^{5}\)

\section{List elements of a power set}
\label{sec:orgf011d74}

\subsection{Python}
\label{sec:org9f69656}
\begin{minted}[,frame=single, breaklines=true]{python}
from itertools import chain, combinations

def powerset(given):
    s=list(given)
    result=chain.from_iterable(combinations(s,r) for r in range(len(s)+1))
    return list(result)

\end{minted}

\subsection{\((a,b,c,d,e)\)}
\label{sec:org419acb5}
\begin{minted}[,frame=single, breaklines=true]{python}
my_set={'a','b','c','d','e'}
seta=powerset(my_set)
seta
\end{minted}

\begin{minted}[,frame=single, breaklines=true]{python}
[(), ('b',), ('a',), ('d',), ('e',), ('c',), ('b', 'a'), ('b', 'd'), ('b', 'e'), ('b', 'c'), ('a', 'd'), ('a', 'e'), ('a', 'c'), ('d', 'e'), ('d', 'c'), ('e', 'c'), ('b', 'a', 'd'), ('b', 'a', 'e'), ('b', 'a', 'c'), ('b', 'd', 'e'), ('b', 'd', 'c'), ('b', 'e', 'c'), ('a', 'd', 'e'), ('a', 'd', 'c'), ('a', 'e', 'c'), ('d', 'e', 'c'), ('b', 'a', 'd', 'e'), ('b', 'a', 'd', 'c'), ('b', 'a', 'e', 'c'), ('b', 'd', 'e', 'c'), ('a', 'd', 'e', 'c'), ('b', 'a', 'd', 'e', 'c')]
\end{minted}

\begin{minted}[,frame=single, breaklines=true]{python}
len(seta)
\end{minted}
\begin{verbatim}
32
\end{verbatim}

\subsection{\((2,4,6,8,10,one)\)}
\label{sec:org17f22cf}
\begin{minted}[,frame=single, breaklines=true]{python}

my_set={2,4,6,8,10,'one'}
setb=powerset(my_set)
setb
\end{minted}

\begin{minted}[]{python}
len(setb)
\end{minted}

\begin{verbatim}
64
\end{verbatim}

\subsection{\((a, 1, b, 2, c, 3, 6, 9, 12, 15, 4, 8, 16)\)}
\label{sec:org8795b36}

\begin{minted}[]{python}

my_set={'a', 1, 'b', 2, 'c', 3, 6, 9, 12, 15, 4, 8, 16}
setc=powerset(my_set)
len(setc)

\end{minted}

\begin{verbatim}
8192
\end{verbatim}

\subsection{\((3, 1, 24, 5, 9, 10, 11, 16, 29, 37, 54, 42, 18)\)}
\label{sec:orga9bd081}

\begin{minted}[]{python}

my_set={3, 1, 24, 5, 9, 10, 11, 16, 29, 37, 54, 42, 18}
setd=powerset(my_set)
len(setd)

\end{minted}

\begin{verbatim}
8192
\end{verbatim}

\subsection{Function to find powerset length}
\label{sec:orgf78f8ce}
In general, the length of a powerset will be \(2^{n}\), where n is the number of elements in a set.
\end{document}
